{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"padding_top":28,"padding_bottom":28}},"rich_text_m4q9PH":{"type":"rich-text","blocks":{"heading_HQbnf3":{"type":"heading","settings":{"heading":"<strong>AIVELA RING PROUser Guide<\/strong>","heading_size":"h1"}},"text_mAatKk":{"type":"text","settings":{"text":"<p><strong>Last Update: June 10, 2025<\/strong><\/p>"}}},"block_order":["heading_HQbnf3","text_mAatKk"],"name":"t:sections.rich-text.presets.name","settings":{"desktop_content_position":"center","content_alignment":"center","color_scheme":"","full_width":true,"padding_top":40,"padding_bottom":52}},"collapsible_content_tPx9Dr":{"type":"collapsible-content","blocks":{"collapsible_row_cMdHXz":{"type":"collapsible_row","settings":{"heading":"1.Getting Started","icon":"none","row_content":"<p>Welcome to AIVELA. This section will help you get started with your AIVELA Ring Pro.<\/p><p><strong>What's in the Box<\/strong><\/p><p>Your AIVELA package includes the following items:<\/p><ul><li>AIVELA Ring Pro<\/li><li>Charging case<\/li><li>Type-C charging cable<\/li><li>User manual<\/li><li>Quick Start Guide<\/li><\/ul><p><\/p><p><strong>Charging the Ring<\/strong><\/p><p>The ring charges magnetically using the charging post inside the case.<br\/><br\/>Align the magnetic charging pin on the inner side of the ring with the charging<br\/>post. Once properly connected, the ring will snap into place and begin charging.<\/p><ul><li>A blue LED indicator on the charging case will light up to confirm that charging has started.<\/li><li>The LED turns off when charging is complete.<\/li><li>The indicator has four segments, representing the battery level of the charging case.<\/li><li>A fully charged case can recharge the ring more than 10 times.<\/li><\/ul><p>To charge the case itself, use the provided Type-C cable.<\/p><p><strong>Wearing the Ring<\/strong><\/p><p>Correct positioning is essential for accurate signal detection and gesture<br\/>functionality.<\/p><ul><li>For optimal use of the touch features, we recommend wearing the ring on your index finger (left or right hand).<\/li><li>Ensure that sensors on inner surface faces the finger pad to maintain reliable signal contact.<\/li><li>The black diamond-shaped window on the outer surface is the optical touch pad and should face your thumb.<\/li><li>The ring should fit securely with consistent skin contact over the sensor area for accurate tracking and proper wear detection.<\/li><\/ul><p><strong>Supported Devices and Operating Systems<\/strong><\/p><p>AIVELA Ring Pro is compatible with the following:<\/p><ul><li>iOS version 15.0 or higher (iPhone 8 and above)<\/li><li>Android version 9.0 or higher, with Bluetooth 5.0 or above<\/li><\/ul><p>Ensure that your phone has Bluetooth enabled and is in close proximity when attempting to pair with the ring.<\/p><p><strong>Download the AIVELA App<\/strong><\/p><p>To begin setup, please download the official AIVELA App from the following link: <a href=\"https:\/\/www.aivela.com\/pages\/app-download\" target=\"_blank\">https:\/\/www.aivela.com\/pages\/app-download<\/a><\/p><p>The app will guide you through the initial pairing process, firmware updates, and basic configuration.<\/p><p><strong>Account Registration<\/strong><\/p><p>To register an account, open the AIVELA App and sign up using your email address. You will receive a verification code via email; enter the code to complete registration. Alternatively, you may choose to sign in with your Apple , Google or Meta account.<\/p><p>After registration, please follow the in-app guide to enter your personal information. This information allows us to tailor health algorithms to your profile and deliver personalized insights and services.<\/p>","page":""}},"collapsible_row_NL9e6A":{"type":"collapsible_row","settings":{"heading":"2.Pairing Your Ring","icon":"none","row_content":"<p>Once your account registration is complete, you can proceed to pair your AIVELA Ring with the app.<\/p><p><strong>How to Pair the Ring<\/strong><\/p><p>To initiate pairing, follow these steps:<\/p><p>1.   Place your ring inside<br\/>the charging case and begin charging. This activates the ring and makes it<br\/>discoverable via Bluetooth.<\/p><p>2.   Ensure your smartphone is<br\/><strong>near the ring<\/strong> and that <strong>Bluetooth is enabled<\/strong>.<\/p><p>3.   Open the AIVELA App and<br\/>follow the on-screen instructions to complete the pairing process.<\/p><p><strong>Troubleshooting Connection Issues<\/strong><\/p><p>If you experience difficulty during the pairing process, try the following steps:<\/p><ul><li><strong>Ensure the ring is charging<\/strong> in the case. If the blue LED on the case is not lit, take the ring out and back in, to ensure tight contact between the ring and the charging case.<\/li><li><strong>Restart Bluetooth <\/strong>on your phone. Turn it off and back on again, then relaunch the AIVELA App.<\/li><li><strong>Move closer to the ring <\/strong>and avoid interference from other Bluetooth devices.<\/li><li>If the ring is still not detected, <strong>force-close and reopen the app<\/strong>, orrestart your phone.<\/li><\/ul><p>If the problem persists, please contact AIVELA Support via support@aivlea.com.<\/p><p><strong>Firmware Update<\/strong><\/p><p>To check for firmware updates, go to the <strong>My Ring<\/strong> tab and tap on the ring image to open the <strong>My Device<\/strong> page.<br\/><br\/>If a green arrow icon appears next to the firmware version number, a new firmware is available.<\/p><p><strong>Before updating:<\/strong><\/p><ul><li>Ensure the ring has <strong>more than 30% battery<\/strong>.<\/li><li>Keep your phone close to the ring.<\/li><li><strong>Do not close the AIVELA App<\/strong>, switch to other apps, or take phone calls during the update.<\/li><li>Wait until the update progress reaches 100% and shows a completion message.<\/li><\/ul><p>If the update appears to be stuck or was interrupted, you may restart the upgrade<br\/>by tapping the update option again.<\/p><p><strong>Wear Calibration<\/strong><\/p><p>AIVELA Ring uses <strong>infrared sensors<\/strong> to detect whether it is being worn.<br\/><br\/>You can view your current <strong>Wear Status <\/strong>in the <strong>My Device<\/strong> section.<\/p><ul><li>When the ring is properly worn, the Wear Status should display <strong>“ON”<\/strong>.<\/li><li>When the ring is removed, it should display <strong>“OFF”<\/strong>.<\/li><\/ul><p>If Wear Status does not switch to “ON” while the ring is being worn, it means<br\/>detection has failed. In that case, tap <strong>“Wear Calibration”<\/strong> and follow the on-screen steps to recalibrate the infrared sensor. After calibration, wear<br\/>the ring again and confirm that the status changes to “ON”.<\/p><p><strong>Note:<\/strong> Wear Status is directly tied to several key functions. If calibration fails to detect wear properly, repeat the calibration process until it responds accurately to being worn and removed.<\/p>","page":""}},"collapsible_row_LXe4AF":{"type":"collapsible_row","settings":{"heading":"3.Daily Use","icon":"none","row_content":"<p>This section covers how to use your AIVELA Ring in daily scenarios and ensure optimal data tracking and performance.<\/p><p><strong>Bluetooth Connection<\/strong><\/p><p>After pairing is completed, a <strong>ring icon<\/strong> will appear in the upper right corner of the app’s home screen.<br\/><br\/>This icon shows the <strong>Bluetooth connection status<\/strong> and <strong>battery level <\/strong>of your ring.<\/p><ul><li>When the connection is active, the ring icon is solid.<\/li><li>If the connection is lost, the icon will show a disconnected state.<\/li><li>Tap the ring icon to manually <strong>reconnect the ring via Bluetooth<\/strong>.<\/li><\/ul><p>Make sure your phone stays within close range to maintain a stable connection throughout the day.<\/p><p><strong>Data Synchronization<\/strong><\/p><p>The AIVELA App will <strong>automatically sync data<\/strong> each time it is opened. During sync, the ring icon will spin to indicate progress. Once the spinning stops, data synchronization is complete.<\/p><p>You can also <strong>manually refresh the data<\/strong> by pulling down on the home screen.<\/p><p>If data does not refresh:<\/p><ul><li>First, <strong>check the Bluetooth connection<\/strong> between your phone and the ring.<\/li><li>If syncing completes but <strong>data visualization does not appear<\/strong>, your phone may not be connected to the internet. Please check your network connection.<\/li><\/ul><p><strong>Battery Status<\/strong><\/p><p>The ring’s battery level is shown visually on the home screen.<br\/><br\/>For detailed percentage, go to <strong>My Device<\/strong> from the <strong>My Ring<\/strong> tab.<\/p><p>Using the AIVELA charging case, a full charge typically takes <strong>less than 30 minutes<\/strong>. To avoid missing data, <strong>put the ring back on promptly after charging<\/strong>.<\/p><p><strong>Wearing During Sleep, Exercise, and Shower<\/strong><\/p><p>Your AIVELA Ring is designed for <strong>all-day, continuous wear<\/strong>:<\/p><ul><li><strong>Sleep<\/strong>: Wear the ring snugly on your index finger before bedtime. Ensure the sensors face your fingertip and the ring maintains skin contact throughout the night to collect sleep stages, movement, and temperature data.<\/li><li><strong>Exercise<\/strong>: AIVELA Ring supports <strong>Sport Mode<\/strong>, which activates the PPG sensor continuously for real-time heart rate monitoring and precise calculation of calories, METs, and other performance metrics.<\/li><\/ul><p><\/p><p>To begin a workout:<\/p><p>① Tap the <strong>quick action button<\/strong> at the top-left corner of the home screen.<\/p><p>② Select <strong>Work Out<\/strong> and choose from 12 supported activity types (e.g. running,<br\/>cycling, tennis, yoga, etc.).<\/p><p>③ Tap <strong>Start<\/strong> to begin recording. The ring will enter Sport Mode.<br\/><br\/>During exercise, you can view live workout data including time, intensity, and physiological responses.<br\/><br\/>After finishing, tap <strong>End<\/strong> to stop the session and view a full activity summary.<\/p><p><strong>Note:<\/strong><br\/>If you forget to manually exit Sport Mode, the ring will automatically switch<br\/>back to power-saving Daily Mode when the battery drops below 20%.<\/p><ul><li><strong>Shower<\/strong>: The ring is <strong>waterproof up to 100 meters<\/strong>, and safe to wear while showering or washing hands. However, avoid extended exposure to hot water or steam, such as in saunas or hot tubs, as it may affect sensor accuracy and battery life.<\/li><\/ul><p><strong>Tips for Accurate Data Collection<\/strong><\/p><p>To ensure high-quality signal and reliable data:<\/p><ul><li>Wear the ring on your <strong>index finger<\/strong>, with the sensor aligned to the finger pad.<\/li><li>Maintain <strong>close, continuous contact<\/strong> between the sensor and your skin.<\/li><li>Avoid wearing the ring too loosely, especially during sleep and exercise.<\/li><li>Keep your phone’s <strong>Bluetooth turned on<\/strong>, and open the app at least once per day to sync your data.<\/li><li>Clean the sensor area regularly with a soft cloth to avoid signal obstruction.<\/li><\/ul>","page":""}},"collapsible_row_AV4MY8":{"type":"collapsible_row","settings":{"heading":"4.Understanding Your Data","icon":"none","row_content":"<p>The AIVELA App is designed to make your health and activity data easy to view, interpret, and act upon. Here's how to access and understand the key metrics we track for you. <\/p><p><strong>Spotlight<\/strong><\/p><p>Upon opening the app, the <strong>Spolight page<\/strong> provides a quick overview of your current status.<br\/><br\/>Here you’ll find daily summaries for:<\/p><ul><li>Vitality Score<\/li><li>Sleep Score<\/li><li>Activity Score<\/li><li>Steps, Calories<\/li><li>Heart Rate, SpO₂, Stress and Stamina<\/li><\/ul><p>Each card is interactive—tap on any metric to access a detailed report.<\/p><p><strong>Trends<\/strong><\/p><p>To explore trends over time, navigate to the <strong>Trends<\/strong> card:<\/p><ul><li>Switch between <strong>Daily<\/strong>, <strong>Weekly<\/strong>, and <strong>Monthly<\/strong> views<\/li><li>Visualize patterns in your sleep, activity, and vitality<\/li><li>Swipe across charts to view historical data by date<\/li><\/ul><p>This view is especially helpful for tracking long-term improvements and detecting irregularities.<\/p><p><strong>Vitality Report<\/strong><\/p><p>In the <strong>Vitality <\/strong>section, you can track:<\/p><ul><li>Daytime Heart Rate and HRV-based Stress<\/li><li>SpO₂ and Stamina trends throughout the day<\/li><li>Temperature changes relative to your baseline<\/li><li>Menstrual cycle predictions (if enabled)<\/li><\/ul><p><strong>Activity Report<\/strong><\/p><p>The <strong>Activity <\/strong>section shows:<\/p><ul><li>All your workout sessions with type, duration, intensity<\/li><li>Calories burned, METmins accumulated<\/li><li>Total active time and step count throughout the day<\/li><\/ul><p>If you used <strong>Sport Mode<\/strong>, each session will be saved with a complete summary in the Workouts session.<\/p><p><strong>Sleep Report<\/strong><\/p><p>In <strong>Sleep <\/strong>Report you can review:<\/p><ul><li>Sleep Time, Time in Bed and Sleep Efficiency<\/li><li>Sleep onset and offset times<\/li><li>Sleep stage breakdown (Light, Deep, REM)<\/li><li>WASO (Wake After Sleep Onset)<\/li><li>Respiratory rate during sleep<\/li><li>Heart rate trends and RHR (Resting Heart Rate)<\/li><li>SpO₂ trends throughout the sleep<\/li><li>Nap durations if any during the daytime<\/li><\/ul><p>This data is personal, secure, and used to support personalized health insights. For help interpreting any metric, simply tap the <strong>info icon (i)<\/strong> next to it for a<br\/>tooltip explanation.<\/p>","page":""}},"collapsible_row_97gxQ9":{"type":"collapsible_row","settings":{"heading":"5.Menstrual Cycle Tracking","icon":"none","row_content":"<p>AIVELA provides optional menstrual cycle tracking for users who wish to monitor their reproductive health more closely. This feature combines <strong>body temperature trends<\/strong> with <strong>manual inputs<\/strong> to estimate cycle phases and predict key windows with growing accuracy.<\/p><p><strong>How It Works<\/strong><\/p><p>Our algorithm learns your cycle by analyzing:<\/p><ul><li><strong>Nightly skin temperature changes<\/strong> captured by the ring<\/li><li><strong>Self-reported cycle events<\/strong>, such as period start and end dates<\/li><\/ul><p>Over time, AIVELA builds a personal baseline for your temperature rhythm and correlates it with your cycle phases to <strong>predict ovulation windows and upcoming periods<\/strong>.<\/p><p><strong>First-Time Setup<\/strong><\/p><p>When you use the Cycle Tracking feature for the first time, the AIVELA App will guide you through a <strong>step-by-step tutorial<\/strong> to log your menstrual history. Simply follow the on-screen instructions to enter your first period data. Once your<br\/>initial entry is complete, the ring will begin generating personalized <strong>cycle predictions<\/strong>.<\/p><p><strong>Ongoing Use<\/strong><\/p><p>At the <strong>end of each cycle<\/strong>, if the predicted menstruation start date is accurate, <strong>no manual input is required<\/strong>—the system will continue forecasting based on your<br\/>historical trends.<\/p><p>If the prediction is inaccurate, you can <strong>correct it manually<\/strong>:<\/p><ul><li>Tap the History button in the Cycle Tracking section<\/li><li>Select the actual first day of your period (Period Day)<\/li><li>Confirm the entry to update your cycle log<\/li><\/ul><p>After at least <strong>three manual corrections<\/strong>, the ring will begin to <strong>learn your unique physiological patterns<\/strong> and adjust its prediction algorithm accordingly, resulting in improved accuracy over time.<\/p><p><strong>Tracking Ovulation Windows<\/strong><\/p><p>Based on your temperature patterns and cycle length, the app will estimate:<\/p><ul><li><strong>Ovulation <\/strong>(typically the 5 days before and the day of ovulation)<\/li><li><strong>Predicted menstruation<\/strong> (start and end)<\/li><li><strong>Cycle length and variation<\/strong><\/li><\/ul><p>You’ll receive notifications or visual highlights when entering a fertile window or approaching your period.<\/p><p><strong>Improving Accuracy Over Time<\/strong><\/p><p>For best results:<\/p><ul><li>Wear the ring <strong>consistently at night<\/strong><\/li><li><strong>Avoid removing it during sleep<\/strong><\/li><li>Log your period <strong>as accurately as possible<\/strong><\/li><\/ul><p>AIVELA protects your privacy—cycle data is encrypted and only used for personalized health recommendations<\/p>","page":""}},"collapsible_row_xagYky":{"type":"collapsible_row","settings":{"heading":"6.AI Health Advisor","icon":"none","row_content":"<p>AIVELA’s AI Health Advisor offers you a uniquely <strong>conversational and personalized health experience<\/strong>, blending scientific standards with human-like interaction. You can consult your AI advisors through chat or voice, gaining quick insights and actionable recommendations based on your wearable data.<\/p><p><strong>Meet Dave & Mira<\/strong><\/p><p>You can interact with two distinctive AI personas:<\/p><ul><li><strong>Dave <\/strong>– A logical, medically-grounded expert focused on evidence-based advice, prevention, and risk assessment<\/li><li><strong>Mira <\/strong>– A warm, motivational coach emphasizing emotional well-being, movement, and everyday balance<\/li><\/ul><p>You may choose to consult with <strong>either<\/strong> advisor individually or speak with <strong>both together <\/strong>for a more well-rounded perspective.<\/p><p><strong>Daily Podcast<\/strong><\/p><p>AIVELA offers a <strong>Daily Podcast<\/strong> feature — a 1 to 3-minute health summary presented in a natural voice. It’s designed to <strong>save time<\/strong> while keeping you informed and motivated.<br\/><br\/>Each podcast episode includes:<\/p><ul><li>A quick review of your current health data<\/li><li>Highlights of changes or concerns<\/li><li><strong>Actionable suggestions<\/strong> tailored to your lifestyle and goals<\/li><\/ul><p>You can listen through voice or read the same content as text — whichever fits your routine best.<\/p><p><strong>How It Works<\/strong><\/p><p>You can consult the AI in <strong>three main ways<\/strong>:<\/p><ul><li>Ask about today’s data<\/li><li>Explore longer-term trends<\/li><li>Get advice on a focused topic, i.e. sleep issues, stress and weight control.<\/li><\/ul><p>The AI provides recommendations based on your individual data and wellness goals. Your AI advisor becomes more accurate and insightful over time. As you continue wearing the AIVELA Ring and logging data, the AI tracks and learns your physiological patterns, so that it may detect subtle trends across sleep, stress, activity, temperature, and recovery.<\/p><p>All advice is grounded in <strong>recognized global health standards<\/strong>, including ACSM, AASM, AHA, WHO, etc. This combination of deep personalization and scientific grounding ensures that your AI advisor delivers insights that are not just<br\/>informative — but relevant, actionable, and designed for long-term balance.<\/p>","page":""}},"collapsible_row_UnRmnW":{"type":"collapsible_row","settings":{"heading":"7.Touch & Gesture","icon":"none","row_content":"<p>AIVELA Ring Pro supports both <strong>Touch Panel controls<\/strong> and <strong>Gesture Recognition<\/strong>,<br\/>enabling a rich and intuitive interaction experience — even without touching your phone.<\/p><p><strong>Touch Controls<\/strong><\/p><p>The touch panel (located on the ring’s black rhombus area) recognizes the following 8 gestures: <strong>Single Tap, Double Tap, Triple Tap, Long Press, Slide Up, Slide Down, Slide Left and Slide Right.<\/strong><\/p><p>These touch actions can be used to remotely control:<\/p><p>1.    <strong>Music<\/strong>: Play\/Pause, Next\/Previous Track, Volume Up\/Down<\/p><p>2.    <strong>Camera<\/strong>: Trigger shutter for remote photo capture<\/p><p>3.    <strong>E-books \/ Presentations<\/strong>: Flip pages or slides<\/p><p>4.    <strong>Short Video Browsing<\/strong>: Swipe through reels or clips<\/p><p><strong>Gesture Recognition<\/strong><\/p><p>Our ring supports 6 air-gesture motions using your fingers and palm: <strong>Finger Pinch, Finger Heart, Palm Slide Left, Palm Slide Right, Palm Flip Left, Palm Flip Right.<\/strong><\/p><p>These gestures allow for contactless control of your device — ideal for fitness, commuting, or hands-free situations.<\/p><p><strong>How to Configure<\/strong><\/p><p>To activate and customize these controls:<\/p><p>1.    Go to <strong>My Ring<\/strong> in the app<\/p><p>2.    Tap <strong>Touch & Gesture<\/strong><\/p><p>3.    <strong>Enable the main switch<\/strong> to turn on interaction features<\/p><p>4.    Tap <strong>Touch Settings<\/strong> to enter the configuration screen<\/p><p>Inside <strong>Touch Settings<\/strong>, you can:<\/p><ul><li>Select <strong>Left-hand or Right-hand<\/strong> wearing mode<\/li><li>Choose one of three control modes:<\/li><li><strong>Music \/ Photo Mode<\/strong><\/li><li><strong>E-book \/ Slide Mode<\/strong><\/li><li><strong>Short Video Mode<\/strong><\/li><li>Toggle the <strong>Gesture switch<\/strong> to enable or disable gesture recognition<\/li><\/ul><p><strong>How to Activate<\/strong><\/p><p>To conserve battery, both touch and gesture sensors remain in a low-power sleep mode by default after these modules are switched on. To activate them:<\/p><ul><li><strong>Touch Panel Activation<\/strong>: Slide your finger up or down on the panel<\/li><li><strong>Gesture Recognition Activation<\/strong>: Triple-tap the panel<\/li><\/ul><p>Once activated, your phone will <strong>vibrate<\/strong> and display a confirmation message. If left unused, the ring will <strong>automatically return to sleep mode<\/strong> after a period of inactivity to save power.<\/p><p><strong>Get Familiar<\/strong><\/p><p>AIVELA provides an in-app tutorial under <strong>Touch Settings &gt; How to Use<\/strong>, where you’ll find:<\/p><ul><li>Illustrated gesture explanations<\/li><li>Default command mappings<\/li><li>A testing interface to <strong>practice each interaction<\/strong><\/li><\/ul><p>With just a few minutes of practice, you’ll discover how seamlessly AIVELA fits into your daily life — bringing smart control to your fingertips, effortlessly.<\/p>","page":""}},"collapsible_row_amaT8N":{"type":"collapsible_row","settings":{"heading":"8.Social & Sharing","icon":"none","row_content":"<p><strong>Zone <\/strong>is designed to bring together a vibrant and supportive health-focused<br\/>community. Here, you can share your progress, connect with others, and stay<br\/>inspired every day.<\/p><p><strong>Share Moments<\/strong><\/p><p>In the Zone tab, you can <strong>post your own content<\/strong> — including photos, captions, reflections on your health journey, or progress updates. Your posts are <strong>publicly visible <\/strong>to all AIVELA users. Others can <strong>like and react<\/strong> to your content. Over time, your posts contribute to a sense of shared motivation and accountability.<\/p><p><strong>Explore Expert Content<\/strong><\/p><p>AIVELA’s official team curates and uploads <strong>high-quality articles<\/strong> and expert content, including:<\/p><ul><li>Tips on sleep improvement, weight loss, diet control, and fitness<\/li><li>Product reviews and unboxings from influencers and health media<\/li><li>Community success stories and usage techniques<\/li><\/ul><p><strong>Build Meaningful Connections<\/strong><\/p><p>You can add people to your network, organizing them into three categories: <strong>Partner, Family <\/strong>and <strong>Friends<\/strong>.<\/p><p>With your permission, <strong>your scores<\/strong> (e.g., Sleep Score, Activity Score, Vitality<br\/>Score) can be <strong>shared with selected contacts<\/strong>, and you can <strong>view their<br\/>progress<\/strong> in return. Cheer them on by tapping \"like\" on their achievements or daily wins.<\/p><p><strong>Gesture-Based Social Interaction<\/strong><\/p><p>Zone is also where <strong>gesture-powered social features<\/strong> come to life. For example: Use the <strong>Finger Heart<\/strong> gesture to send a virtual heart to your <strong>Partner<\/strong>, instantly creating a warm and intimate connection. <\/p><p><strong>Zone <\/strong>blends community, education, and emotional connection — making AIVELA not just a health tool, but a space where wellness becomes a shared experience.<\/p>","page":""}},"collapsible_row_BzMMBT":{"type":"collapsible_row","settings":{"heading":"9.Settings & Personalization","icon":"none","row_content":"<p>AIVELA allows you to personalize your experience with flexible system settings, user preferences, and data management tools. All relevant options can be accessed from the <strong>My Ring<\/strong> tab within the app.<\/p><p><strong>Language and Units<\/strong><\/p><p>Navigate to <strong>My Ring &gt; Settings<\/strong>, where you can select your preferred <strong>language<\/strong> and choose between: <strong>Metric units<\/strong> (kg, °C, km) and <strong>Imperial units <\/strong>(lbs, °F, miles)<\/p><p><strong>User Profile<\/strong><\/p><p>Go to <strong>My Ring &gt; Profile<\/strong> to update your personal information.<br\/><br\/>You can modify the following details:<\/p><ul><li>User name & avatar<\/li><li>Email address & phone number<\/li><li>Country \/ Region<\/li><li>Gender & date of birth<\/li><li>Height & weight<\/li><\/ul><p>These details are essential for tailoring health metrics and delivering accurate personalized insights.<\/p><p><strong>Notification Management<\/strong><\/p><p>Under <strong>My Ring &gt; Notification Management<\/strong>, you can control which app notifications you wish to receive. Options include:<\/p><ul><li><strong>Low battery alerts<\/strong><\/li><li><strong>Sedentary reminders<\/strong><\/li><li><strong>Social message previews<\/strong><\/li><li><strong>Menstrual cycle notifications<\/strong> (for female users)<\/li><\/ul><p>Enable or disable each type of alert based on your lifestyle and preferences.<\/p><p><strong>Data Management<\/strong><\/p><p>In <strong>My Ring &gt; Data Management<\/strong>, you have full control over how your data is stored and shared:<\/p><ul><li><strong>Cloud Sync<\/strong>: Turn on or off automatic synchronization to cloud storage<\/li><li><strong>Clear Ring Data<\/strong>: Erase all data stored locally on the ring<\/li><li><strong>Clear Cloud Data<\/strong>: Permanently delete all your cloud-based health records<\/li><li><strong>Sharing Settings<\/strong>: Choose whether your health scores (e.g., Sleep, Activity) are visible to selected friends, family and partner<\/li><li><strong>Third-Party Sync<\/strong>: Enable data sharing with <strong>Apple Health<\/strong>, <strong>Google Fit<\/strong>, or <strong>Strava<\/strong><\/li><\/ul>","page":""}},"collapsible_row_drWpGj":{"type":"collapsible_row","settings":{"heading":"10. Safety & Maintenance","icon":"none","row_content":"<p>To ensure optimal performance, long-term reliability, and safe usage of your AIVELA Ring, please follow the guidelines below.<\/p><p><strong>Wear & Comfort<\/strong><\/p><ul><li><strong>Proper Fit<\/strong>: Your ring should fit snugly but comfortably. Avoid wearing it too tightly to prevent discomfort or skin irritation.<\/li><li><strong>Sensor Contact<\/strong>: Ensure the inner sensor surface maintains consistent skin contact for accurate readings.<\/li><li><strong>Switch Fingers When Needed<\/strong>: If irritation occurs, try switching the ring to another finger to allow your skin to rest.<\/li><\/ul><p><strong>Water Resistance<\/strong><\/p><ul><li>AIVELA Ring is rated <strong>water-resistant up to 100 meters<\/strong>, suitable for <strong>daily handwashing, showering, swimming<\/strong>, and even light water sports.<\/li><li><strong>Do not use <\/strong>the ring in hot tubs, saunas, or during deep diving activities.<\/li><li>After exposure to salt water or chlorine, <strong>rinse with clean water and dry gently<\/strong>.<\/li><\/ul><p><strong>Charging Safety<\/strong><\/p><ul><li>Always use the <strong>original charging case and cable<\/strong> provided in the box.<\/li><li>Place the ring carefully onto the <strong>magnetic charging pillar<\/strong>—charging begins when the indicator light turns blue.<\/li><li><strong>Do not charge <\/strong>the ring if the charging case or ring is visibly wet—ensure all parts are fully dry before connecting power.<\/li><\/ul><p><strong>Cleaning Guidelines<\/strong><\/p><ul><li>Clean the ring gently using a <strong>soft cloth<\/strong>, slightly dampened with water if needed.<\/li><li>Avoid abrasive cleaners, alcohol, or harsh chemicals that may damage the surface or sensors.<\/li><li>For the <strong>sensor area<\/strong>, use a microfiber cloth to prevent residue buildup.<\/li><\/ul><p><strong>Software & Firmware<\/strong><\/p><ul><li>Keep your <strong>AIVELA App up to date<\/strong> to access the latest features and security improvements.<\/li><li>Regularly check for <strong>firmware updates<\/strong> in the <strong>My Device<\/strong> section and follow upgrade instructions carefully.<\/li><li>Avoid closing the app or moving away from the ring during updates.<\/li><\/ul><p><strong>Battery Health<\/strong><\/p><ul><li>Charge your ring <strong>when battery drops below 20%<\/strong>, and aim to <strong>complete a full charge<\/strong> when possible.<\/li><li>Avoid leaving the ring discharged for long periods — this may affect battery lifespan.<\/li><li>Do not attempt to disassemble or replace the battery on your own.<\/li><\/ul><p><strong>Safe Use Reminders<\/strong><\/p><ul><li>AIVELA Ring is <strong>not a medical device<\/strong> and should not be used for diagnosis or treatment.<\/li><li>If you experience prolonged discomfort, swelling, or allergic reaction, remove the ring and consult a physician.<\/li><li>Keep the ring <strong>out of reach of young children<\/strong> to prevent accidental swallowing or misuse.<\/li><\/ul>","page":""}},"collapsible_row_q9eEcm":{"type":"collapsible_row","settings":{"heading":"11. Frequently Asked Questions","icon":"none","row_content":"<p><strong>What should I do if my ring is not connecting to my phone?<\/strong><br\/><br\/>Ensure the ring is placed in the charging case and actively charging. Make sure<br\/>Bluetooth is enabled on your phone, and keep the ring nearby. If the issue<br\/>persists, restart Bluetooth, reboot your phone, or contact AIVELA Support.<\/p><p><strong> <\/strong><\/p><p><strong>How long does it take to fully charge the ring?<\/strong><br\/><br\/>Using the official charging case, the ring typically takes less than 30 minutes<br\/>to reach a full charge.<\/p><p><strong> <\/strong><\/p><p><strong>How often should I sync my data?<\/strong><br\/><br\/>We recommend opening the AIVELA App at least once daily. Data syncs<br\/>automatically when the app launches and can also be triggered manually by<br\/>pulling down the home screen.<\/p><p><strong> <\/strong><\/p><p><strong>Can I wear the ring while sleeping, showering, or exercising?<\/strong><br\/><br\/>Yes. The AIVELA Ring Pro is designed for 24\/7 use — including during sleep,<br\/>exercise, and showers. However, avoid using it in hot water environments like<br\/>saunas or hot tubs.<\/p><p><strong> <\/strong><\/p><p><strong>Why is my Wear Status not turning ON when I wear the ring?<\/strong><br\/><br\/>This may indicate the need for Wear Calibration. Go to <em>My Device &gt; Wear<br\/>Calibration<\/em>, follow the steps, and ensure the sensor maintains proper<br\/>contact with your skin.<\/p><p> <\/p><p><strong>What happens if I forget to exit Sport Mode after a workout?<\/strong><br\/><br\/>The ring will automatically exit Sport Mode and return to Daily Mode when the<br\/>battery drops below 20%.<\/p><p> <\/p><p><strong>Can I use the AI Health Advisor without enabling voice?<\/strong><br\/><br\/>Yes. All AI feedback is presented in text format by default. You can also<br\/>enable Daily Podcast to receive the same insights in spoken form.<\/p><p> <\/p><p><strong>What devices and systems are compatible with AIVELA Ring Pro?<\/strong><br\/><br\/>AIVELA supports iOS 15.0+ (iPhone 8 or newer) and Android 9.0+ devices with<br\/>Bluetooth 5.0 or higher.<\/p><p> <\/p><p><strong>How accurate is Menstrual Cycle Tracking?<\/strong><br\/><br\/>Accuracy improves over time. The system learns your personal temperature<br\/>patterns and cycle history after at least 3 cycles of consistent wear and<br\/>manual correction, leading to more precise predictions.<\/p><p> <\/p><p><strong>How do I turn on touch and gesture features?<\/strong><br\/><br\/>Go to <em>My Ring &gt; Touch & Gesture<\/em> and enable the main switch. Use<br\/>Slide Up\/Down to activate Touch, and Triple Tap to activate Gesture<br\/>Recognition. Refer to the in-app tutorial for guidance.<\/p><p> <\/p><p><strong>Can I delete all my data?<\/strong><br\/><br\/>Yes. Go to <em>My Ring &gt; Data Management<\/em>, where you can clear ring data,<br\/>cloud data, and control third-party sync settings.<\/p><p> <\/p><p><strong>Is AIVELA Ring a medical device?<\/strong><br\/><br\/>No. AIVELA Ring is a wellness tracker designed for lifestyle and health<br\/>optimization. It is not intended to diagnose, treat, or cure medical<br\/>conditions.<\/p><p> <\/p><p>For more personalized assistance, we recommend consulting our AI Health Advisors, Dave or Mira, directly within the AIVELA App — or contacting our support team at <strong>support@aivela.com<\/strong>.<\/p>","page":""}}},"block_order":["collapsible_row_cMdHXz","collapsible_row_NL9e6A","collapsible_row_LXe4AF","collapsible_row_AV4MY8","collapsible_row_97gxQ9","collapsible_row_xagYky","collapsible_row_UnRmnW","collapsible_row_amaT8N","collapsible_row_BzMMBT","collapsible_row_drWpGj","collapsible_row_q9eEcm"],"name":"t:sections.collapsible_content.presets.name","settings":{"caption":"","heading":"","heading_size":"h1","heading_alignment":"center","layout":"none","container_color_scheme":"","color_scheme":"","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}}},"order":["main","rich_text_m4q9PH","collapsible_content_tPx9Dr"]}